In [5]:
import pandas as pd 
#reading dat from a csv  file
df=pd.read_csv('/home/ayush/Downloads/com.csv')
#dpd.read_csv('urlof file') #reading the file from url
df.info() #gives info about file

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name          6 non-null object
Department    4 non-null object
Manager       4 non-null object
Salary        6 non-null int64
dtypes: int64(1), object(3)
memory usage: 272.0+ bytes

In [6]:
#to print all data
df

            Name Department      Manager  Salary
0     Robin Hood        NaN          NaN     200
1  Arsene Wenger        Bar   Friar Tuck      50
2     Friar Tuck        Foo   Robin Hood     100
3    Little John        Foo   Robin Hood     100
4  Sam Allardyce        NaN          NaN     250
5  Dimi Berbatov        Foo  Little John      50

In [7]:
# top 3 rows only 
df.head(3)

            Name Department     Manager  Salary
0     Robin Hood        NaN         NaN     200
1  Arsene Wenger        Bar  Friar Tuck      50
2     Friar Tuck        Foo  Robin Hood     100

In [8]:
# last three rows
df.tail(3)

            Name Department      Manager  Salary
3    Little John        Foo   Robin Hood     100
4  Sam Allardyce        NaN          NaN     250
5  Dimi Berbatov        Foo  Little John      50

In [9]:
#particular column
df["Name"]

0       Robin Hood
1    Arsene Wenger
2       Friar Tuck
3      Little John
4    Sam Allardyce
5    Dimi Berbatov
Name: Name, dtype: object

In [11]:
# for selecting rows and columns
df.iloc[0: ,0]

0       Robin Hood
1    Arsene Wenger
2       Friar Tuck
3      Little John
4    Sam Allardyce
5    Dimi Berbatov
Name: Name, dtype: object

In [12]:
# for selecting rows and columns
df.iloc[0: ,0:2]

            Name Department
0     Robin Hood        NaN
1  Arsene Wenger        Bar
2     Friar Tuck        Foo
3    Little John        Foo
4  Sam Allardyce        NaN
5  Dimi Berbatov        Foo

In [13]:
# for selecting rows and columns
df.iloc[0: ,[0,3]]

            Name  Salary
0     Robin Hood     200
1  Arsene Wenger      50
2     Friar Tuck     100
3    Little John     100
4  Sam Allardyce     250
5  Dimi Berbatov      50

In [14]:
#salary column only
df["Salary"]

0    200
1     50
2    100
3    100
4    250
5     50
Name: Salary, dtype: int64

In [17]:
#salary column only with max
df["Salary"].max()

250

In [18]:
#salary column only with min
df["Salary"].min()

50

In [19]:
#salary column only with mean
df["Salary"].mean()

125.0

In [20]:
df["Salary"].sum()

750

In [25]:
print(df.values)
x=df.values
type(x)

[['Robin Hood' nan nan 200]
 ['Arsene Wenger' 'Bar' 'Friar Tuck' 50]
 ['Friar Tuck' 'Foo' 'Robin Hood' 100]
 ['Little John' 'Foo' 'Robin Hood' 100]
 ['Sam Allardyce' nan nan 250]
 ['Dimi Berbatov' 'Foo' 'Little John' 50]]

numpy.ndarray

In [28]:
df["Salary"].values

array([200,  50, 100, 100, 250,  50])